(function(n){function t(t){for(var r,i,o=t[0],p=t[1],u=t[2],h=0,f=[];h<o.length;h++)i=o[h],Object.prototype.hasOwnProperty.call(s,i)&&s[i]&&f.push(s[i][0]),s[i]=0;for(r in p)Object.prototype.hasOwnProperty.call(p,r)&&(n[r]=p[r]);c&&c(t);while(f.length)f.shift()();return a.push.apply(a,u||[]),e()}function e(){for(var n,t=0;t<a.length;t++){for(var e=a[t],r=!0,o=1;o<e.length;o++){var p=e[o];0!==s[p]&&(r=!1)}r&&(a.splice(t--,1),n=i(i.s=e[0]))}return n}var r={},s={app:0},a=[];function i(t){if(r[t])return r[t].exports;var e=r[t]={i:t,l:!1,exports:{}};return n[t].call(e.exports,e,e.exports,i),e.l=!0,e.exports}i.m=n,i.c=r,i.d=function(n,t,e){i.o(n,t)||Object.defineProperty(n,t,{enumerable:!0,get:e})},i.r=function(n){"undefined"!==typeof Symbol&&Symbol.toStringTag&&Object.defineProperty(n,Symbol.toStringTag,{value:"Module"}),Object.defineProperty(n,"__esModule",{value:!0})},i.t=function(n,t){if(1&t&&(n=i(n)),8&t)return n;if(4&t&&"object"===typeof n&&n&&n.__esModule)return n;var e=Object.create(null);if(i.r(e),Object.defineProperty(e,"default",{enumerable:!0,value:n}),2&t&&"string"!=typeof n)for(var r in n)i.d(e,r,function(t){return n[t]}.bind(null,r));return e},i.n=function(n){var t=n&&n.__esModule?function(){return n["default"]}:function(){return n};return i.d(t,"a",t),t},i.o=function(n,t){return Object.prototype.hasOwnProperty.call(n,t)},i.p="/ege26generator/";var o=window["webpackJsonp"]=window["webpackJsonp"]||[],p=o.push.bind(o);o.push=t,o=o.slice();for(var u=0;u<o.length;u++)t(o[u]);var c=p;a.push([0,"chunk-vendors"]),e()})({0:function(n,t,e){n.exports=e("56d7")},"56d7":function(n,t,e){"use strict";e.r(t);e("e260"),e("e6cf"),e("cca6"),e("a79d");var r=e("2b0e"),s=function(){var n=this,t=n.$createElement,e=n._self._c||t;return e("div",{attrs:{id:"app"}},[1==n.game.type?e("div",[e("p",[e("span",{staticClass:"number"},[n._v("19")]),n._v(" Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может "),e("span",{staticClass:"bolder"},[n._v(n._s(n.moveTxt))])]),e("p",[n._v("Например, имея кучу из 10 камней, за один ход можно получить кучу из "+n._s(10+n.game.a)+" или "+n._s(10*n.game.b)+" камней. У каждого игрока, чтобы делать ходы, есть неограниченное количество камней.")]),e("p",[n._v("Игра завершается в тот момент, когда количество камней в куче становится не менее "+n._s(n.game.winS)+". Победителем считается игрок, сделавший последний ход, то есть первым получивший кучу, в которой будет "+n._s(n.game.winS)+" или больше камней. В начальный момент в куче было S камней, 1 ≤ S ≤ "+n._s(n.game.winS-1))])]):n._e(),2==n.game.type?e("div",[e("p",[e("span",{staticClass:"number"},[n._v("19")]),n._v(" Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежат две кучи камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может "),e("span",{staticClass:"bolder"},[n._v(n._s(n.moveTxt))]),n._v(".")]),e("p",[n._v("Например, пусть в одной куче 6 камней, а в другой 9 камней; такую позицию мы будем обозначать (6, 9). За один ход из позиции (6, 9) можно получить любую из четырёх позиций: ("+n._s(6+n.game.a)+",9), ("+n._s(6*n.game.b)+",9), (6,"+n._s(9+n.game.a)+"), (6,"+n._s(9*n.game.b)+"). Чтобы делать ходы, у каждого игрока есть неограниченное количество камней.")]),e("p",[n._v("Игра завершается в тот момент, когда суммарное количество камней в кучах становится не менее "+n._s(n.game.winS)+". Победителем считается игрок, сделавший последний ход, то есть первым получивший позицию, в которой в кучах будет "+n._s(n.game.winS)+" или больше камней. В начальный момент в первой куче было "+n._s(n.game.heap[0][0])+" камней, во второй куче – S камней, 1 ≤ S ≤ "+n._s(n.game.winS-n.game.heap[0][0]-1)+".")])]):n._e(),n._m(0),n.game.answer.step2.length>0?e("p",[n._v("Укажите "+n._s(n.valueTxt(n.game.answer.step2))+" S, при которых Петя не может выиграть за один ход, но при любом ходе Пети Ваня может выиграть своим первым ходом. Опишите выигрышную стратегию Вани.")]):e("p",[n._v("Известно, что Ваня выиграл своим первым ходом после неудачного первого хода Пети. Укажите минимальное значение S, когда такая ситуация возможна.")]),e("p",[e("span",{staticClass:"number"},[n._v("20")]),n._v(" Укажите "+n._s(n.valueTxt(n.game.answer.step3))+" S, при которых у Пети есть выигрышная стратегия, причём Петя не может выиграть первым ходом, но Петя может выиграть своим вторым ходом, независимо от того, как будет ходить Ваня. Для указанных значений S опишите выигрышную стратегию Пети.")]),e("p",[e("span",{staticClass:"number"},[n._v("21")]),n._v(" Укажите "+n._s(n.valueTxt(n.game.answer.step4))+" S, при котором у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети, и при этом у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом. Для указанных значений S опишите выигрышную стратегию Вани. Постройте дерево всех партий, возможных при этой выигрышной стратегии Вани (в виде рисунка или таблицы). На рёбрах дерева указывайте, кто делает ход, в узлах – количество камней в позиции.")]),e("span",{staticClass:"hintButton",on:{click:function(t){n.answer=!n.answer}}},[n._v("Примерное решение")]),n.answer?e("div",[e("div",{staticClass:"code",domProps:{innerHTML:n._s(n.game.code)}}),e("br"),e("p",[n._v("Ответ"),e("br"),n.game.answer.step2.length>0?e("span",[n._v("19 ["+n._s(n.enumeration(n.game.answer.step2))+"]")]):e("span",[n._v("19 "+n._s(n.game.answer.step21[0][1]))]),e("br"),n._v(" 20 ["+n._s(n.enumeration(n.game.answer.step3))+"]"),e("br"),n._v(" 21 ["+n._s(n.enumeration(n.game.answer.step4))+"]")])]):n._e()])},a=[function(){var n=this,t=n.$createElement,e=n._self._c||t;return e("p",[n._v("Говорят, что игрок имеет "),e("span",{staticClass:"bolder"},[n._v("выигрышную стратегию")]),n._v(", если он может выиграть при любых ходах противника. Описать стратегию игрока – значит описать, акой ход он должен сделать в любой ситуации, которая ему может встретиться при различной игре противника.")])}],i=(e("99af"),e("4160"),e("159b"),e("a623"),e("d81d"),e("13d5"),e("45fc"),function(n,t){return Math.floor(n+Math.random()*(t+1-n))});Array.prototype.max=function(){return Math.max.apply(null,this)},Array.prototype.sum=function(){return this.reduce((function(n,t){return n+t}))},Array.prototype.random=function(){return this[i(0,this.length-1)]};var o={count:0,heap:[],winS:0,a:0,b:0,move:[],answer:{},strategy:{},code:"",win:function(n){return n.sum()>=this.winS},getMoves:function(n){for(var t=[],e=0;e<n.length;e++)for(var r=0;r<this.move.length;r++){var s=[].concat(n);s[e]=this.move[r](s[e]),t.push(s)}return t},isWin:function(n){var t=this;return this.getMoves(n).some((function(n){return t.win(n)}))},analyze:function(n,t,e){var r=this;if(this.win(n))return t%2==e%2;if(t>e)return!1;var s=this.getMoves(n).map((function(n){return r.analyze(n,t+1,e)}));return(t+1)%2==e%2?s.some((function(n){return n})):s.every((function(n){return n}))},analyze2:function(n,t){var e=this;if(this.win(n))return t%2==0;if(t>2)return!1;var r=this.getMoves(n).map((function(n){return e.analyze2(n,t+1)}));return r.some((function(n){return n}))},addEdge:function(n,t,e){return'"'.concat(n,'" -> "').concat(t,'"\n [label="').concat(1==e?"П":"В",'"]')},winMove:function(n,t){for(var e=this.getMoves(n),r=0;r<e.length;r++)if(this.win(e[r]))return this.addEdge(n,e[r],t)},plotEdges:function(n,t){var e=this,r=arguments.length>2&&void 0!==arguments[2]?arguments[2]:1,s=r%2;if(this.isWin(n)&&t==s)return this.winMove(n,s);for(var a=this.getMoves(n),i=a.map((function(n){return e.analyze(n,r+1)})),o=i.map((function(n){return null!=n?n%2:null})),p="",u=0;u<o.length;u++)if(o[u]==t&&(p+=this.addEdge(n,a[u],s)+this.plotEdges(a[u],t,r+1),o[u]==s))break;return p},plotGraph:function(n){var t=this.analyze(n),e=t%2,r='strict digraph { rankdir="LR"\n'+this.plotEdges(n,e)+"\n}";return r},getAnswer:function(){var n=this,t=[],e=[],r=[],s=[];this.heap.forEach((function(a){for(var i=1;i<=4;i++)if(n.analyze2(a,0)&&e.push(a),n.analyze(a,0,i))return 2==i&&t.push(a),3==i&&r.push(a),void(4==i&&s.push(a))})),this.answer={step2:t,step21:e,step3:r,step4:s}},generateCode:function(){return 1==this.type?"from functools import lru_cache<br>\n            <br>\n            def moves(h):<br>\n            &nbsp;&nbsp;return h+".concat(this.a,", h*").concat(this.b,"<br>\n            <br>\n            @lru_cache(None)<br>\n            def game(h):<br>\n            &nbsp;&nbsp;if h >= ").concat(this.winS,": return 'w'<br>\n            &nbsp;&nbsp;if any(game(i)=='w' for i in moves(h)): return 'p1'<br>\n            &nbsp;&nbsp;if all(game(i)=='p1' for i in moves(h)): return 'v1'<br>\n            &nbsp;&nbsp;if any(game(i)=='v1' for i in moves(h)): return 'p2'<br>\n            &nbsp;&nbsp;if all(game(i)=='p1' or game(i)=='p2' for i in moves(h)): return 'v2'<br>\n            <br>\n            &nbsp;&nbsp;print('19',[s for s in range(1, ").concat(this.winS,") if game(s)=='v1'])<br>\n            &nbsp;&nbsp;print('20',[s for s in range(1, ").concat(this.winS,") if game(s)=='p2'])<br>\n            &nbsp;&nbsp;print('21',[s for s in range(1, ").concat(this.winS,") if game(s)=='v2'])"):2==this.type?"from functools import lru_cache<br>\n            <br>\n            def moves(h):<br>\n            &nbsp;&nbsp;return (a+".concat(this.a,",b), (a*").concat(this.b,",b), (a,b+").concat(this.a,"), (a,b*").concat(this.b,")\n            <br>\n            @lru_cache(None)<br>\n            def game(h):<br>\n            &nbsp;&nbsp;if sum(h) >= ").concat(this.winS,": return 'w'<br>\n            &nbsp;&nbsp;if any(game(i)=='w' for i in moves(h)): return 'p1'<br>\n            ").concat(0==this.answer.step2.length?"&nbsp;&nbsp;#для 19 задания all заменяется на any<br>":"","\n            &nbsp;&nbsp;if all(game(i)=='p1' for i in moves(h)): return 'v1'<br>\n            &nbsp;&nbsp;if any(game(i)=='v1' for i in moves(h)): return 'p2'<br>\n            &nbsp;&nbsp;if all(game(i)=='p1' or game(i)=='p2' for i in moves(h)): return 'v2'<br>\n            <br>\n            ").concat(0==this.answer.step2.length?"&nbsp;&nbsp;print('19',min(s for s in range(1, ".concat(this.winS-this.heap[0][0],") if game((").concat(this.heap[0][0],", s))=='v1'))<br>"):"&nbsp;&nbsp;print('19',[s for s in range(1, ".concat(this.winS-this.heap[0][0],") if game((").concat(this.heap[0][0],", s))=='v1'])<br>"),"\n            &nbsp;&nbsp;print('20',[s for s in range(1, ").concat(this.winS-this.heap[0][0],") if game((").concat(this.heap[0][0],", s))=='p2'])<br>\n            &nbsp;&nbsp;print('21',[s for s in range(1, ").concat(this.winS-this.heap[0][0],") if game((").concat(this.heap[0][0],", s))=='v2'])"):void 0},init:function(){var n=this;if(Math.random()<=.3){this.type=1;var t=i(50,100);this.a=i(1,3),this.b=i(2,4);for(var e=1;e<=t;e++)this.heap.push([e]);this.winS=t+1,this.move=[function(t){return t+n.a},function(t){return t*n.b}],this.getAnswer(),this.code=this.generateCode()}else{this.type=2;var r=i(1,10),s=i(50,100);this.a=i(1,3),this.b=i(2,4);for(var a=1;a<=s;a++)this.heap.push([r,a]);this.winS=r+s+1,this.move=[function(t){return t+n.a},function(t){return t*n.b}],this.getAnswer(),0!=this.answer.step3.length&&0!=this.answer.step4.length||(this.answer={},this.heap=[],this.init()),this.code=this.generateCode()}}};o.init();var p=o,u=["один камень","два камня","три камня","четыре камня","пять камней"],c=["два раза","три раза","четыре раза"],h=["одно значение","два значения","три значения","четыре значения","пять значений","шесть значений","семь значений","восемь значений","девять значений","десять значений"],f={name:"App",data:function(){return{game:p,answer:!1,n1:u,n2:c,n3:h}},computed:{moveTxt:function(){var n=1==p.type?"добавить в кучу ":"добавить в одну из куч ";return n+"".concat(u[p.a-1]," или увеличить количество камней в куче в ").concat(c[p.b-2])}},methods:{valueTxt:function(n){return h[n.length-1]},interval:function(n){return 1==p.type?"".concat(n[0],"...").concat(n[n.length-1]):"".concat(n[0][1],"...").concat(n[n.length-1][1])},enumeration:function(n){var t="";return n.forEach((function(n){return t+=n[1]?n[1]+", ":n+", "})),t.substr(0,t.length-2)},getStrategy:function(n){var t=this,e="";return n.forEach((function(n){var r=Viz(t.game.plotGraph(n),{format:"svg"});e+=r})),e}}},v=f,b=(e("dda2"),e("2877")),l=Object(b["a"])(v,s,a,!1,null,null,null),m=l.exports;r["a"].config.productionTip=!1,new r["a"]({render:function(n){return n(m)}}).$mount("#app")},dda2:function(n,t,e){"use strict";var r=e("ff10"),s=e.n(r);s.a},ff10:function(n,t,e){}});
//# sourceMappingURL=app.868f1402.js.map